
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ShotaTakayama/aws-ecs-terraform/actions/runs/5465348151)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00cd9ad0b470092e0]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d6459ef7d1d67a60]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0b8965b27aeaea56b]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0e439f10f125a1664]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0be02ca0769426113]
aws_security_group.ecs: Refreshing state... [id=sg-0d081b689ee7e0836]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09f90e54f8f22418f]
aws_security_group.alb: Refreshing state... [id=sg-030bffab5bae97658]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-009637ee9fab801b5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-036bc96b487cb0e81]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07802214fac513794]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0702615a6ac281046]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cc8ac56822eba90b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dafa2a8668b8c4ca]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0dd2e5dd95765208b]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030afd5026a95c533]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0702615a6ac2810461080289494]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-4034492785]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a54a13632a869962]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05beb4e9c1c31ad28]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02148733d699d4c19]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b46d08c692da6f4b]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-084768b7929ad6987]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-02ca9b8628c492134]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-009637ee9fab801b51080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0be02ca07694261131080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-030bffab5bae97658",
        ]
      + subnets                                     = [
          + "subnet-036bc96b487cb0e81",
          + "subnet-07802214fac513794",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-00cd9ad0b470092e0"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:472153192489:targetgroup/go-simple-server-target-group/ab1ffa6cbdc50b50]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Creation complete after 2m15s [id=arn:aws:elasticloadbalancing:ap-northeast-1:472153192489:loadbalancer/app/go-simple-server-alb/af7682fe2630a6df]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:472153192489:listener/app/go-simple-server-alb/af7682fe2630a6df/d3351d27df98e680]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:472153192489:listener-rule/app/go-simple-server-alb/af7682fe2630a6df/d3351d27df98e680/419af1742c282a3e]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"fce92b44aebd3354619cc98815265ae67bf90820","Vars":{},"WorkflowName":"Terraform"} -->